Revit 2027 API
StructuralSectionGeneralS Constructor
 Creates a new instance of Round Bar shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionGeneralS(
	double diameter,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Public Sub New (
	diameter As Double,
	centroidHorizontal As Double,
	centroidVertical As Double,
	analysisParams As StructuralSectionAnalysisParams
)
public:
StructuralSectionGeneralS(
	double diameter,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
new :
        diameter : float *
        centroidHorizontal : float *
        centroidVertical : float *
        analysisParams : StructuralSectionAnalysisParams -> StructuralSectionGeneralS
Parameters
diameter Double
 Pipe Diameter.
centroidHorizontal Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
Reference
StructuralSectionGeneralS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace